src/cfe/МенеджерСинхронизаций/Catalogs/МС_ЗапросыКВнешнимИсточникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>МС_ЗапросыКВнешнимИсточникам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресатПерсонализированнойРассылки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерактивнаяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКодЗапроса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУведомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияНовыхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияОбработанныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияОшибок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопироватьФайлыВЛокальныйКаталог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодифицироватьИмяФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцедураПодготовкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗапросаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧЗначенияПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧНастройкаСоответствий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьФайлыИзКаталогаИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПользователя</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Просмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Редактирование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>МС_НастройкиСинхронизации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВычисляемыйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычисляемыйПериодНачалоПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычисляемыйПериодОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезаписыватьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезаписыватьСправочники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соединение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МС_НастройкиПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиЗагрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НастройкаЗагрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МС_ЗапросыКВнешнимИсточникам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Catalogs/МС_ЗапросыКВнешнимИсточникам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Функция выполняет запрос и получение или отправку данных
//
// Параметры:
//  СтруктураПараметров  - Структура - Структура с параметрами обмена
//  Выгруза  - Булево - Признак необходимости отправки данных, вместо получения (актуально для файлового обмена)
//
// Возвращаемое значение:
//   Произвольный   - Результат обмена. Данные для загрузки, или результат отправки данных
//
Функция ВыполнитьЗапросКИсточнику(СтруктураПараметров, Выгруза = Ложь) Экспорт
	
	ТекстЗапроса = СтруктураПараметров.ТекстЗапроса;
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Соединение) Тогда
		СтруктураСоединения = Справочники.МС_НастройкиПодключений.ПолучитьСоединение(СтруктураПараметров.Соединение);
	Иначе	
		СтруктураСоединения = Новый Структура;
		СтруктураСоединения.Вставить("Соединение", Неопределено);
		СтруктураСоединения.Вставить("СтрокаОшибок", "");
	КонецЕсли; 
	
	Если СтруктураПараметров.ИнтерактивнаяЗагрузка = Ложь Тогда
	
		// Возвращаем код ошибки, только при неинтерактивной загрузке.
		// При интерактивной загрузке пользователь загружает данные из табличного документа без соединения

		// Соединение вообще может не использоваться, например при запросе файлов из каталога
		//Если СтруктураСоединения.Соединение = Неопределено Тогда
		//	Возврат СтруктураСоединения.СтрокаОшибок;
		//КонецЕсли; 
	
	КонецЕсли; 
	
	РезультатЗапроса = Неопределено;
	
	Если СтруктураПараметров.СпособЗапросаДанных = ""
		Или СтруктураПараметров.СпособЗапросаДанных = "ПроизвольныйРезультат" Тогда
		// произвольный запрос возвращает произвольный результат, который определен в коде запроса
		
		Выполнить(СтруктураПараметров.КодЗапроса);
		
	ИначеЕсли СтруктураПараметров.СпособЗапросаДанных = "ФайлыИзКаталога" Тогда
		
		Если Выгруза Тогда
			
			// Записываем файлы в каталог
			Если ТипЗнч(СтруктураПараметров.РезультатВыгрузки) = Тип("Массив") Тогда
				Для Каждого ФайлМассива из СтруктураПараметров.РезультатВыгрузки Цикл
					
					ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлМассива.АдресВременногоХранилища);
					ФайлМассива.Вставить("ФайлВыгрузилсяУспешно", Истина);
					
					Попытка
						ДвоичныеДанные.Записать(СтруктураПараметров.КаталогФайлов + "\" + ФайлМассива.ИмяФайла);
					Исключение
						ФайлМассива.Вставить("ФайлВыгрузилсяУспешно", Ложь);
					КонецПопытки;
					
				КонецЦикла;
			КонецЕсли;
			
			РезультатЗапроса = Истина;
			
		Иначе
			
			// возвращает массив файлов 
			//МаскаФайлов = "*.xml";
			МаскаФайлов = ?(ЗначениеЗаполнено(СтруктураПараметров.МаскаФайлов), СтруктураПараметров.МаскаФайлов, "*.xml");
			
			
			Если СтруктураПараметров.Свойство("УдалятьФайлыИзКаталогаИсточника")
				И СтруктураПараметров.УдалятьФайлыИзКаталогаИсточника = Истина Тогда
				// Если удаляем в источнике, то всегда сохраняем себе
				Если СтруктураПараметров.Свойство("КопироватьФайлыВЛокальныйКаталог") Тогда
					СтруктураПараметров.КопироватьФайлыВЛокальныйКаталог = Истина;
				КонецЕсли;  
			КонецЕсли; 
			
			ФайлКаталогСохраненияНовыхФайлов 		= Новый Файл(СтруктураПараметров.КаталогСохраненияНовыхФайлов);
			ФайлКаталогСохраненияОбработанныхФайлов = Новый Файл(СтруктураПараметров.КаталогСохраненияОбработанныхФайлов);
			ФайлКаталогСохраненияОшибок 			= Новый Файл(СтруктураПараметров.КаталогСохраненияОшибок);
			
			Если СтруктураПараметров.КопироватьФайлыВЛокальныйКаталог = Истина Тогда
				// Проверяем сущесвование каталогов
				Если Не ФайлКаталогСохраненияНовыхФайлов.Существует() Тогда
					ВызватьИсключение("Каталог " + Строка(СтруктураПараметров.КаталогСохраненияНовыхФайлов) + " не существует");
				КонецЕсли; 
				Если Не ФайлКаталогСохраненияОбработанныхФайлов.Существует() Тогда
					ВызватьИсключение("Каталог " + Строка(СтруктураПараметров.КаталогСохраненияОбработанныхФайлов) + " не существует");
				КонецЕсли; 
				Если Не ФайлКаталогСохраненияОшибок.Существует() Тогда
					ВызватьИсключение("Каталог " + Строка(СтруктураПараметров.КаталогСохраненияОшибок) + " не существует");
				КонецЕсли; 
				
				// Убедимся, что это каталоги
				Если Не ФайлКаталогСохраненияНовыхФайлов.ЭтоКаталог() Тогда
					ВызватьИсключение("Путь " + Строка(СтруктураПараметров.КаталогСохраненияНовыхФайлов) + " не является каталогом");
				КонецЕсли; 
				Если Не ФайлКаталогСохраненияОбработанныхФайлов.ЭтоКаталог() Тогда
					ВызватьИсключение("Путь " + Строка(СтруктураПараметров.КаталогСохраненияОбработанныхФайлов) + " не является каталогом");
				КонецЕсли; 
				Если Не ФайлКаталогСохраненияОшибок.ЭтоКаталог() Тогда
					ВызватьИсключение("Путь " + Строка(СтруктураПараметров.КаталогСохраненияОшибок) + " не является каталогом");
				КонецЕсли; 
			КонецЕсли; 
			
			//РезультатЗапроса = НайтиФайлы(СтруктураПараметров.КаталогФайлов, МаскаФайлов, Ложь);
			МассивФайлов = НайтиФайлы(СтруктураПараметров.КаталогФайлов, МаскаФайлов, Ложь);
			Если СтруктураПараметров.КопироватьФайлыВЛокальныйКаталог = Истина Тогда
				
				НовыйПутьКФайлу = СтруктураПараметров.КаталогСохраненияНовыхФайлов;
				Если Не Прав(НовыйПутьКФайлу, 1) = "\" Тогда
					НовыйПутьКФайлу = НовыйПутьКФайлу + "\"
				КонецЕсли;
				Для Каждого ФайлВИсточнике Из МассивФайлов Цикл
					
					// Исключаем временные файлы экселя - их обработка привожит к ошибкам
					Если Лев(ФайлВИсточнике.ИмяБезРасширения, 2) = "~$" Тогда
						Продолжить;
					КонецЕсли;
					
					НовоеИмяФайла = ФайлВИсточнике.ИмяБезРасширения 
						+ ?(СтруктураПараметров.МодифицироватьИмяФайла, Формат(ТекущаяДатаСеанса(), "ДФ=dd_MM_yyyy_HH_mm_ss"), "");
					
					Если СтруктураПараметров.МодифицироватьИмяФайла И НайтиФайлы(НовыйПутьКФайлу, НовоеИмяФайла).Количество() <> 0 Тогда
						НовоеИмяФайла = НовоеИмяФайла + Строка(Новый УникальныйИдентификатор);
					КонецЕсли;
					
					КопироватьФайл(ФайлВИсточнике.ПолноеИмя, НовыйПутьКФайлу + НовоеИмяФайла + ФайлВИсточнике.Расширение);
					
					// Если копируем файл в локальный каталог, то последующая работа выполняется со скопированным файлом.
					Если СтруктураПараметров.Свойство("УдалятьФайлыИзКаталогаИсточника")
						И СтруктураПараметров.УдалятьФайлыИзКаталогаИсточника = Истина Тогда
						НовыйПолученныйФайл = Новый Файл(НовыйПутьКФайлу + НовоеИмяФайла+ ФайлВИсточнике.Расширение);
						Если НовыйПолученныйФайл.Существует()
							И НовыйПолученныйФайл.ЭтоФайл() Тогда
						    УдалитьФайлы(ФайлВИсточнике.ПолноеИмя);
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
				РезультатЗапроса = НайтиФайлы(СтруктураПараметров.КаталогСохраненияНовыхФайлов, МаскаФайлов, Ложь);
				
			Иначе
				
				РезультатЗапроса =  НайтиФайлы(СтруктураПараметров.КаталогФайлов, МаскаФайлов, Ложь);;
				
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли СтруктураПараметров.СпособЗапросаДанных = "ФайлыСФТП" Тогда
		
		Если Выгруза Тогда
			
			// Записываем файлы на ФТП
			
			СтруктураСоединения.Соединение.УстановитьТекущийКаталог(СтруктураПараметров.КаталогФайлов);
			
			Если ТипЗнч(СтруктураПараметров.РезультатВыгрузки) = Тип("Массив") Тогда
				Для Каждого ФайлМассива из СтруктураПараметров.РезультатВыгрузки Цикл
					
					ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлМассива.АдресВременногоХранилища);
					ФайлМассива.Вставить("ФайлВыгрузилсяУспешно", Истина);
					
					Попытка
						ВременныйПоток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
						СтруктураСоединения.Соединение.Записать(ФайлМассива.ИмяФайла, ВременныйПоток)
					Исключение
						ОписаниеОшибки = ОписаниеОшибки();
						ФайлМассива.Вставить("ФайлВыгрузилсяУспешно", Ложь);
					КонецПопытки;
					
				КонецЦикла;
			КонецЕсли;

			РезультатЗапроса = Истина;
			
		Иначе
			
			// возвращает массив файлов 
			//МаскаФайлов = "*.xml";
			МаскаФайлов = ?(ЗначениеЗаполнено(СтруктураПараметров.МаскаФайлов), СтруктураПараметров.МаскаФайлов, "*.xml");
			
			Если СтруктураПараметров.Свойство("УдалятьФайлыИзКаталогаИсточника")
				И СтруктураПараметров.УдалятьФайлыИзКаталогаИсточника = Истина Тогда
				// Если удаляем в источнике, то всегда сохраняем себе
				СтруктураПараметров.КопироватьФайлыВЛокальныйКаталог = Истина;
			КонецЕсли; 
			
			ФайлКаталогСохраненияНовыхФайлов 		= Новый Файл(СтруктураПараметров.КаталогСохраненияНовыхФайлов);
			ФайлКаталогСохраненияОбработанныхФайлов = Новый Файл(СтруктураПараметров.КаталогСохраненияОбработанныхФайлов);
			ФайлКаталогСохраненияОшибок 			= Новый Файл(СтруктураПараметров.КаталогСохраненияОшибок);
			
			Если СтруктураПараметров.КопироватьФайлыВЛокальныйКаталог = Истина Тогда
				// Проверяем сущесвование каталогов
				Если Не ФайлКаталогСохраненияНовыхФайлов.Существует() Тогда
					ВызватьИсключение("Каталог " + Строка(СтруктураПараметров.КаталогСохраненияНовыхФайлов) + " не существует");
				КонецЕсли; 
				Если Не ФайлКаталогСохраненияОбработанныхФайлов.Существует() Тогда
					ВызватьИсключение("Каталог " + Строка(СтруктураПараметров.КаталогСохраненияОбработанныхФайлов) + " не существует");
				КонецЕсли; 
				Если Не ФайлКаталогСохраненияОшибок.Существует() Тогда
					ВызватьИсключение("Каталог " + Строка(СтруктураПараметров.КаталогСохраненияОшибок) + " не существует");
				КонецЕсли; 
				
				// Убедимся, что это каталоги
				Если Не ФайлКаталогСохраненияНовыхФайлов.ЭтоКаталог() Тогда
					ВызватьИсключение("Путь " + Строка(СтруктураПараметров.КаталогСохраненияНовыхФайлов) + " не является каталогом");
				КонецЕсли; 
				Если Не ФайлКаталогСохраненияОбработанныхФайлов.ЭтоКаталог() Тогда
					ВызватьИсключение("Путь " + Строка(СтруктураПараметров.КаталогСохраненияОбработанныхФайлов) + " не является каталогом");
				КонецЕсли; 
				Если Не ФайлКаталогСохраненияОшибок.ЭтоКаталог() Тогда
					ВызватьИсключение("Путь " + Строка(СтруктураПараметров.КаталогСохраненияОшибок) + " не является каталогом");
				КонецЕсли; 
			КонецЕсли; 
			
			СтруктураСоединения.Соединение.УстановитьТекущийКаталог(СтруктураПараметров.КаталогФайлов);
			МассивФайловВИсточнике = СтруктураСоединения.Соединение.НайтиФайлы("*", , Ложь);
			
			Если СтруктураПараметров.КопироватьФайлыВЛокальныйКаталог = Истина Тогда
				
				Для каждого ФайлВИсточнике Из МассивФайловВИсточнике Цикл
					ПолноеИмяПолученногоФайла = СтруктураПараметров.КаталогСохраненияНовыхФайлов + "\" + ФайлВИсточнике.Имя;
					СтруктураСоединения.Соединение.Получить(ФайлВИсточнике.ПолноеИмя, ПолноеИмяПолученногоФайла);
					
					// Если копируем файл в локальный каталог, то последующая работа выполняется со скопированным файлом.
					НовыйПолученныйФайл = Новый Файл(ПолноеИмяПолученногоФайла);
					Если НовыйПолученныйФайл.Существует()
						И НовыйПолученныйФайл.ЭтоФайл() Тогда
						
						Если СтруктураПараметров.Свойство("УдалятьФайлыИзКаталогаИсточника")
							И СтруктураПараметров.УдалятьФайлыИзКаталогаИсточника = Истина Тогда
							СтруктураСоединения.Соединение.Удалить(ФайлВИсточнике.ПолноеИмя);
						КонецЕсли;
						
					КонецЕсли; 
					
				КонецЦикла;
				
				РезультатЗапроса = НайтиФайлы(СтруктураПараметров.КаталогСохраненияНовыхФайлов, МаскаФайлов, Ложь);
				
			Иначе
				
				РезультатЗапроса = МассивФайловВИсточнике;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ВыполнитьЗагрузкуДокументов(НастройкиСинхронизации, ВернутьРезультат = Ложь, ДополнительныеПараметры = Неопределено) Экспорт

	РезультатЗагрузки = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.НастройкаЗагрузки КАК НастройкаЗагрузки,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.Соединение КАК Соединение,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.НачалоПериода КАК НачалоПериода,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.ОкончаниеПериода КАК ОкончаниеПериода,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.ВычисляемыйПериод КАК ВычисляемыйПериод,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.ВычисляемыйПериодНачалоПериода КАК ВычисляемыйПериодНачалоПериода,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.ВычисляемыйПериодОкончаниеПериода КАК ВычисляемыйПериодОкончаниеПериода,
	|	МС_ЗапросыКВнешнимИсточникам.*
	|ИЗ
	|	Справочник.МС_НастройкиСинхронизации.НастройкиЗагрузки КАК МС_НастройкиСинхронизацииНастройкиЗагрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МС_ЗапросыКВнешнимИсточникам КАК МС_ЗапросыКВнешнимИсточникам
	|		ПО МС_НастройкиСинхронизацииНастройкиЗагрузки.НастройкаЗагрузки = МС_ЗапросыКВнешнимИсточникам.Ссылка
	|ГДЕ
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка = &Ссылка
	|	И МС_НастройкиСинхронизацииНастройкиЗагрузки.Активно
	|	И МС_НастройкиСинхронизацииНастройкиЗагрузки.НомерСтроки = &НомерСтрокиНастройки";
	
	Запрос.УстановитьПараметр("Ссылка", НастройкиСинхронизации);
	
	ВызовИзФормы = Ложь;
	НомерСтрокиНастройки = "";
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		
		Если ДополнительныеПараметры.Свойство("ВызовИзФормы") = Истина Тогда
			ВызовИзФормы = Истина;
			НомерСтрокиНастройки = ДополнительныеПараметры.НомерСтрокиНастройки;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВызовИзФормы Тогда
		Запрос.УстановитьПараметр("НомерСтрокиНастройки", Число(НомерСтрокиНастройки));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И МС_НастройкиСинхронизацииНастройкиЗагрузки.НомерСтроки = &НомерСтрокиНастройки", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураПараметров = Новый Структура;
		Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
			СтруктураПараметров.Вставить(Колонка.Имя,ВыборкаДетальныеЗаписи[Колонка.Имя]);
		КонецЦикла;
		
		// Вычисление периода
		Если СтруктураПараметров.ВычисляемыйПериод Тогда
			Выполнить("СтруктураПараметров.НачалоПериода = " + СтруктураПараметров.ВычисляемыйПериодНачалоПериода);
			Выполнить("СтруктураПараметров.ОкончаниеПериода = " + СтруктураПараметров.ВычисляемыйПериодОкончаниеПериода);
		Иначе
			СтруктураПараметров.ОкончаниеПериода = КонецДня(СтруктураПараметров.ОкончаниеПериода);
		КонецЕсли; 
		
		СтруктураПараметров.Вставить("ЗначенияПараметров", ОбщегоНазначения.ЗначениеИзСтрокиXML(ВыборкаДетальныеЗаписи.ТЧЗначенияПараметров));
		СтруктураПараметров.Вставить("НастройкаСоответствий", ОбщегоНазначения.ЗначениеИзСтрокиXML(ВыборкаДетальныеЗаписи.ТЧНастройкаСоответствий));
		Если ДополнительныеПараметры <> Неопределено Тогда
			СтруктураПараметров.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
		КонецЕсли;
		
		// Заполнение параметров из ДополнительныеПараметры.
		// Дополнительные параметры имеют более высокий приоритет и заменяют параметры в структуре параметров (например можно подменить дату)
		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
			Для каждого ДополнительныйПараметр Из ДополнительныеПараметры Цикл
				СтруктураПараметров.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
			КонецЦикла; 
		КонецЕсли;
		
		// Подготовка данных для запроса к внешнему источнику
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПроцедураПодготовкиДанных) Тогда
			Выполнить(ВыборкаДетальныеЗаписи.ПроцедураПодготовкиДанных + "(НастройкиСинхронизации, СтруктураПараметров, , РезультатЗагрузки)");
		КонецЕсли;
		
		// Загрузка
		Если ВыборкаДетальныеЗаписи.ТипОбмена = 0 Тогда
			
			// Выполнение обмена
			РезультатЗапросаКИсточнику = ВыполнитьЗапросКИсточнику(СтруктураПараметров);
			
			// Используется для отчетов с анализом внешних данных
			Если ВернутьРезультат = Истина Тогда
				Возврат РезультатЗапросаКИсточнику;
			КонецЕсли; 
			
			// Обработка результата обмена
			Если Не РезультатЗапросаКИсточнику = Неопределено
				И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Процедура) Тогда
				Выполнить(ВыборкаДетальныеЗаписи.Процедура + "(НастройкиСинхронизации, СтруктураПараметров, РезультатЗапросаКИсточнику, РезультатЗагрузки)");
			КонецЕсли;
			
		// Выгрузка
		ИначеЕсли ВыборкаДетальныеЗаписи.ТипОбмена = 1 Тогда
			
			СтруктураПараметров.Вставить("РезультатВыгрузки", РезультатЗагрузки);
				
			РезультатВыгрузки = ВыполнитьЗапросКИсточнику(СтруктураПараметров, Истина);
			
			Выполнить(ВыборкаДетальныеЗаписи.Процедура + "(НастройкиСинхронизации, СтруктураПараметров, РезультатЗапросаКИсточнику, РезультатВыгрузки)");
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецФункции

#КонецЕсли
